---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRunWidthLessThanMinimumFailure
source: html/f83594e7-676d-3278-a7d9-8e67bd868761.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRunWidthLessThanMinimumFailure Property

Actual run width is less than minimum run width defined in stairs type.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsActualRunWidthLessThanMinimumFailure { get; }
```